ZhiKong0/nolebase-template/笔记/MCU_Learning/STM32学习/02进阶/PID算法/Project_Refactor-0417 copy/User/main.c
static void process_key_event(void)
{
    KeyEvent_t evt = BspKey_Read();
    if (evt == KEY_EVENT_NONE)
        return;

    if (evt == KEY_EVENT_SHORT_PRESS)
    {
        if (is_running())
        {
            transition_stop(EXP_TRIGGER_KEY);
        }
        else
        {
            transition_start(EXP_TRIGGER_KEY);
        }
    }
    else if (evt == KEY_EVENT_LONG_PRESS)
    {
        transition_toggle_mode();
    }
}

/* ========== Command Parsing ========== */

static uint8_t cmd_parse_u32(const char *s, uint32_t *out)
{
    uint32_t value = 0u;
    uint8_t digits = 0u;
    const char *p = s;

    if (*p == '+')
        p++;
    while (*p >= '0' && *p <= '9')
    {
        value = (value * 10u) + (uint32_t)(*p - '0');
        digits = 1u;
        p++;
    }
    if (!digits)
        return 0u;
    if (*p != '\0' && *p != '!')
        return 0u;
    *out = value;
    return 1u;
}

static uint8_t cmd_copy_token(const char *src, char *out, uint8_t outSize)
{
    uint8_t i = 0u;

    if (!src || !out || outSize == 0u)
        return 0u;

    while (*src != '\0' && *src != '!' && i < (uint8_t)(outSize - 1u))
    {
        out[i++] = *src++;
    }
    out[i] = '\0';
    return (i > 0u) ? 1u : 0u;
}

static void refresh_runtime_tune(void)
{
    /* TuneParams 只拥有“当前参数值”，真正参与闭环的是 g_pid / g_lineTrack。
       所以每次串口写参后，都要把最新参数同步到当前运行态。 */
    DualLoop_RefreshTune(&g_pid, g_mode);
    LineTrack_RefreshTune();
    g_displayDirty = 1u;
}

static void send_param_list(const char *group)
{
    char buf[256];
    uint16_t i;
    uint16_t count = 0u;

    for (i = 0u; i < TuneParams_Count(); i++)
    {
        if (!TuneParams_GroupMatches(i, group))
            continue;
        if (TuneParams_FormatListLine(i, buf, sizeof(buf)))
        {
            BspUart_SendString(buf);
            count++;
        }
    }

    sprintf(buf, "OK:PLIST,count=%u\r\n", (unsigned)count);
    BspUart_SendString(buf);
}

static void send_param_value(const char *key)
{
    char buf[256];

    if (TuneParams_FormatValueLine(key, buf, sizeof(buf)))
        BspUart_SendString(buf);
    else
        BspUart_SendString("ERR:PGET\r\n");
}

static void apply_param_write(const char *key, const char *valueText)
{
    char buf[192];

    if (!key || !valueText)
    {
        BspUart_SendString("ERR:PSET\r\n");
        return;
    }

    if (!TuneParams_SetByText(key, valueText, buf, sizeof(buf)))
    {
        BspUart_SendString("ERR:PSET\r\n");
        return;
    }

    refresh_runtime_tune();
    BspUart_SendString(buf);
    send_param_value(key);
}

static uint8_t try_handle_legacy_param_write(const char *legacyKey, const char *valueText)
{
    const char *mappedKey = TuneParams_MapLegacyKey(g_mode, legacyKey);

    if (!mappedKey)
        return 0u;

    apply_param_write(mappedKey, valueText);
    return 1u;
}

static void send_experiment_id_response(void)
{
    char buf[32];

    sprintf(buf, "OK:EXP=%lu\r\n", (unsigned long)g_experimentId);
    BspUart_SendString(buf);
}

static void sync_experiment_id(uint32_t experimentId)
{
    g_experimentId = experimentId;
    BspOled_ShowExperimentId(g_experimentId);
    g_displayDirty = 1u;
}

static void handle_command(const char *cmd)
{
    uint32_t u32val;
    char keyBuf[48];
    char valBuf[24];
    char buf[128];
    const char *comma;
    uint8_t i;
    uint16_t resetCount;

    if (strcmp(cmd, "#RUN!") == 0)
    {
        transition_start(EXP_TRIGGER_UART);
        BspUart_SendString("OK:RUN\r\n");
        return;
    }
    if (strcmp(cmd, "#STOP!") == 0)
    {
        transition_stop(EXP_TRIGGER_UART);
        BspUart_SendString("OK:STOP\r\n");
        return;
    }
    if (strcmp(cmd, "#EXP?!") == 0)
    {
        send_experiment_id_response();
        return;
    }
    if (strcmp(cmd, "#EXPHOST=OFF!") == 0)
    {
        g_experimentHostSyncUntilTick = 0u;
        BspUart_SendString("OK:EXPHOST=OFF\r\n");
        return;
    }
    if (strncmp(cmd, "#EXPHOST=", 9) == 0)
    {
        if (cmd_parse_u32(cmd + 9, &u32val))
        {
            g_experimentHostSyncUntilTick = g_tickMs + EXP_HOST_SYNC_TIMEOUT_MS;
            if (!is_running() && g_experimentId < u32val)
                sync_experiment_id(u32val);
        }
        return;
    }
    if (strncmp(cmd, "#EXP=", 5) == 0)
    {
        if (!is_running() && cmd_parse_u32(cmd + 5, &u32val))
        {
            sync_experiment_id(u32val);
            send_experiment_id_response();
        }
        else if (is_running())
        {
            BspUart_SendString("ERR:EXP=RUNNING\r\n");
        }
        return;
    }
    if (strcmp(cmd, "#PING!") == 0)
    {
        BspUart_SendString("OK:PONG\r\n");
        return;
    }
    /* 通用参数协议从这里进入:
       - LIST / GET / GET_GROUP 负责可枚举和可观测
       - SET / DEFAULTS 负责可复现实验
       后面的旧命令只作为别名保留。 */
    if (strcmp(cmd, "#PLIST!") == 0)
    {
        send_param_list(0);
        return;
    }
    if (strncmp(cmd, "#PGET=", 6) == 0)
    {
        if (cmd_copy_token(cmd + 6, keyBuf, sizeof(keyBuf)))
            send_param_value(keyBuf);
        else
            BspUart_SendString("ERR:PGET\r\n");
        return;
    }
    if (strncmp(cmd, "#PGETG=", 7) == 0)
    {
        if (cmd_copy_token(cmd + 7, keyBuf, sizeof(keyBuf)))
            send_param_list(keyBuf);
        else
            BspUart_SendString("ERR:PGETG\r\n");
        return;
    }
    if (strcmp(cmd, "#PDEF!") == 0)
    {
        resetCount = TuneParams_LoadDefaults(0);
        refresh_runtime_tune();
        sprintf(buf, "OK:PDEF,count=%u\r\n", (unsigned)resetCount);
        BspUart_SendString(buf);
        return;
    }
    if (strncmp(cmd, "#PDEF=", 6) == 0)
    {
        if (!cmd_copy_token(cmd + 6, keyBuf, sizeof(keyBuf)))
        {
            BspUart_SendString("ERR:PDEF\r\n");
            return;
        }
        resetCount = TuneParams_LoadDefaults(keyBuf);
        if (resetCount == 0u)
        {
            BspUart_SendString("ERR:PDEF\r\n");
            return;
        }
        refresh_runtime_tune();
        sprintf(buf, "OK:PDEF,group=%s,count=%u\r\n", keyBuf, (unsigned)resetCount);
        BspUart_SendString(buf);
        return;
    }
    if (strncmp(cmd, "#PSET=", 6) == 0)
    {
        comma = strchr(cmd + 6, ',');
        if (!comma)
        {
            BspUart_SendString("ERR:PSET\r\n");
            return;
        }

